<template>
  <div id="who-job-event" style="display: none" class="fancybox__content">
    <div class="modal who-event">
      <div class="banners__event-image">
        <div class="banners__event-overlay">
          <h2>В поиске сокровищ</h2>
          <p>Как это работает?</p>
        </div>
        <img
          src="/assets/images/event.png"
          class="banners__event-image-bg"
          alt="Фон события и турнира"
        />
      </div>
      <div class="modal__body typical">
        <h3>Как участвовать в Поиске сокровищ?</h3>
        <p>
          Всё просто! Пополняете баланс, открывайте кейсы. За каждое открытие кейсов вы
          можете получить очки в школе прогресса, попадать в Таблицу Лидеров и получать
          ещё больше вкусных бонусов и наград.
        </p>
        <h3>За что я могу получить поинты для шкалы прогресса?</h3>
        <p>За каждое открытие кейсов, пополнение баланса можно получить очки.</p>
        <h3>Как часто сбрасывается шкала прогресса?</h3>
        <p>
          Таблица лидеров, накопленные очки и шкала кейсов сбрасываются в конце инвента,
          следите за таймером "Сброс через".
        </p>
        <h3>Я попал в топ, когда смогу получить свой приз?</h3>
        <p>
          В правом верхнем углу ивента, можно увидеть надпись "Сброс через" и таймер.
          Когда таймер истечёт - скины будут автоматически зачислены. Призы начисляются
          согласно Вашему месту в таблице лидеров в момент завершения таймера.
        </p>
      </div>
    </div>
    <button class="carousel__button is-close" data-fancybox-close>
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" tabindex="-1">
        <path d="M20 20L4 4m16 0L4 20"></path>
      </svg>
    </button>
  </div>
</template>
